Repository: wolfsoft/dbpager
Catalog: po/*.po
Languages: ru_ru

source: Internal error: {0}
ru_ru: Внутренняя ошибка: {0}

source: dbPager Language interpretator
ru_ru: интерпретатор языка dbPager

source: show application version
ru_ru: показать версию приложения

source: name
ru_ru: имя

source: use an alternate configuration file
ru_ru: использовать альтернативный файл конфигурации

source: URL|file [[param1=value] ... [paramN=value]]
ru_ru: URL|файл [[парам1=значение] ... [парамN=значение]]

source: the URL or file name is not defined
ru_ru: URL или имя файла не определено

source: Copyright (c) 2008-2015 Dennis Prochko <wolfsoft@mail.ru>
ru_ru: Авторские права (c) 2008-2015 Прочко Денис <wolfsoft@mail.ru>

source: dbPager FastCGI Server
ru_ru: Сервер dbPager FastCGI

source: Initialization failed
ru_ru: Проблема при инициализации

source: Can't bind to the {0}. Check your access rights or check for some other program using this resource
ru_ru: Невозможно привязаться к {0}. Проверьте ваши права доступа или наличие других программ, использующих этот ресурс

source: Can't switch current group to {0} - check your access rights
ru_ru: Невозможно сменить текущую группу на {0} - проверьте ваши права доступа

source: No such group {0}
ru_ru: Нет такой группы {0}

source: Can't switch current user to {0} - check your access rights
ru_ru: Невозможно сменить текущего пользователя на {0} - проверьте ваши права доступа

source: No such user {0}
ru_ru: Нет такого пользователя {0}

source: Unknown error
ru_ru: Неизвестная ошибка

source: Fatal error: can't parse file {0}
ru_ru: Ошибка при разборе файла '{0}' - продолжение невозможно

source: invalid XML structure of the request
ru_ru: некорректная XML структура запроса

source: Configuration file "{0}" was not found; will use default values instead
ru_ru: Конфигурационный файл "{0}" не найден; будут использованы значения по умолчанию

source: Configuration realoaded
ru_ru: Конфигурация перезагружена

source: Validity warning at line {0}: {1}
ru_ru: Предупреждение валидации на строке {0}: {1}

source: Validity error at line {0}: {1}
ru_ru: Ошибка валидации на строке {0}: {1}

source: Warning at line {0}: {1}
ru_ru: Предупреждение на строке {0}: {1}

source: Error at line {0}: {1}
ru_ru: Ошибка на строке {0}: {1}

source: unable to open file '{0}'. {1}
ru_ru: невозможно открыть файл '{0}'. {1}

source: failed to parse file '{0}'. {1}
ru_ru: ошибка при разборе файла '{0}'. {1}

source: invalid nested tags ({0})
ru_ru: неверная вложенность тегов ({0})

source: href parameter missing for tag include
ru_ru: у тега include отсутствует параметр href

source: wrong number of arguments ({0} instead {1} expected)
ru_ru: неверное число аргументов ({0} вместо ожидаемых {1})

source: file {0} can't be deleted
ru_ru: файл {0} не может быть удалён

source: unbalanced expression braces found
ru_ru: найдены не сбалансированные скобки выражения

source: invalid expression: {0} expected
ru_ru: неверное выражение: ожидался {0}

source: parameter(s) are not defined for function '{0}', expected '(', found '{1}'
ru_ru: параметр(ы) для функции '{0}' не определен(ы), ожидалась '(', найдено '{1}'

source: invalid expression: ")" expected
ru_ru: неверное выражение: ожидалась ")"

source: unknown expression token '{0}'
ru_ru: неизвестный оператор '{0}' в выражении

source: can't convert the string to a number
ru_ru: невозможно преобразовать строку в число

source: invalid expression: primary expected
ru_ru: неверное выражение: ожидалось число

source: unknown tag found ({0})
ru_ru: обнаружен неизвестный тег ({0})

source: http request failed: {0}
ru_ru: не удалось выполнить http запрос: {0}

source: message domain (domain) is not defined
ru_ru: домен сообщений (domain) не определен

source: base directory of the hierarchy containing message catalogs (path) is not defined
ru_ru: основной каталог иерархии, содержащий файлы сообщений (path) не определен

source: file {0} not found or read error
ru_ru: файл {0} не найден или ошибка чтения файла

source: file {0} can't be renamed
ru_ru: файл {0} не может быть переименован

source: parameter 'name' is undefined
ru_ru: параметр 'name' не определен

source: invalid 'order' parameter value. expected (asc,desc). found: {0}
ru_ru: неверное значение параметра 'order'. ожидалось (asc, desc). найдено: {0}

source: can't write to file {0}
ru_ru: невозможно записать данные в файл {0}

source: variable {0} is not defined
ru_ru: переменная {0} не определена

source: unknown variable type {0}
ru_ru: неизвестный тип переменной '{0}'

source: custom tag '{0}' is not defined at this scope
ru_ru: вызываемый тег '{0}' не определен в этой области видимости

source: key name (name) is not defined
ru_ru: имя ключа (name) не определено

source: (default)
ru_ru: (по умолчанию)

source: storage (id='{0}') is not defined in the current context
ru_ru: хранилище (id='{0}') не определено в текущем контексте

source: storage can't be opened ({0})
ru_ru: не удается открыть хранилище ({0})

source: storage is not opened
ru_ru: хранилище не открыто

source: can't retrieve data from the storage ({0})
ru_ru: невозможно получить данные из хранилища ({0})

source: can't add data to the storage ({0})
ru_ru: невозможно добавить данные в хранилище ({0})

source: can't delete data from the storage ({0})
ru_ru: невозможно удалить данные из хранилища ({0})

source: storage file name (href) is not defined
ru_ru: имя файла хранилища (href) не определено

source: gearman server is not defined in the current context
ru_ru: сервер gearman не определен в текущем контексте

source: MongoDB server host name (host) is not defined
ru_ru: Имя сервера MongoDB (host) не определено

source: query collection (collection) is not defined
ru_ru: коллекция (collection) не определена

source: MongoDB database is not defined in the current context
ru_ru: База данных MongoDB не определена в текущем контексте

source: query is not defined in the current context
ru_ru: запрос не определен в текущем контексте

source: parameter name (name) is not defined
ru_ru: имя параметра (name) не определено

source: data source name (dsn) is not defined
ru_ru: имя источника данных (dsn) не определено

source: database (id='{0}') is not defined in the current context
ru_ru: база данных (id='{0}') не определена в текущем контексте

source: Can't allocate memory to fetch query results
ru_ru: Невозможно выделить память для получения результатов выполнения запроса

source: can't parse stylesheet file '{0}'
ru_ru: невозможно разобрать файл шаблона '{0}'

source: the input stream does not contain the valid XML data
ru_ru: входной поток не содержит корректных XML данных

source: can't transform XML data
ru_ru: невозможно преобразовать данные XML
